import complex

:p complex_floor $ Complex 0.3 0.6
> Complex(0., 0.)
:p complex_floor $ Complex 0.6 0.8
> Complex(0., 1.)
:p complex_floor $ Complex 0.8 0.6
> Complex(1., 0.)
:p complex_floor $ Complex 0.6 0.3
> Complex(0., 0.)

a = Complex 2.1 0.4
b = Complex (-1.1) 1.3
:p (a + b - a) ~~ b
> True
:p (a * b) ~~ (b * a)
> True
:p divide (a * b) a ~~ b
> True
-- This next test can be added once we parameterize the field in the VSpace typeclass.
--:p ((a * b) / a) ~~ b
--> True
:p a == b
> False
:p a == a
> True
:p log (exp a) ~~ a
> True
:p exp (log a) ~~ a
> True
:p log2 (exp2 a) ~~ a
> True
:p exp2 (log2 a) ~~ a
> True
:p sqrt (sq a) ~~ a
> True
:p log ((Complex 1.0 0.0) + a) ~~ log1p a
> True
:p sin (-a) ~~ (-(sin a))
> True
:p cos (-a) ~~ cos a
> True
:p tan (-a) ~~ (- (tan a))
> True
:p exp (pi .* (Complex 0.0 1.0)) ~~ (Complex (-1.0) 0.0)  -- Euler's identity
> True
:p ((sq (sin a)) + (sq (cos a))) ~~ (Complex 1.0 0.0)
> True
:p complex_abs b > 0.0
> True

:p sinh (Complex 1.2 3.2)
> Complex(-1.506887, -0.1056956)
:p cosh (Complex 1.2 3.2)
> Complex(-1.807568, 0.08811359)
:p tanh (Complex 1.1 0.1)
> Complex(0.8033752, 0.03580933)
:p tan (Complex 1.2 3.2)
> Complex(0.002250167, 1.002451)
