:p complex_floor $ MkComplex 0.3 0.6
> (MkComplex 0. 0.)
:p complex_floor $ MkComplex 0.6 0.8
> (MkComplex 0. 1.)
:p complex_floor $ MkComplex 0.8 0.6
> (MkComplex 1. 0.)
:p complex_floor $ MkComplex 0.6 0.3
> (MkComplex 0. 0.)

a = MkComplex 2.1 0.4
b = MkComplex (-1.1) 1.3
:p (a + b - a) ~~ b
> True
:p (a * b) ~~ (b * a)
> True
:p divide (a * b) a ~~ b
> True
-- This next test can be added once we parameterize the field in the VSpace typeclass.
--:p ((a * b) / a) ~~ b
--> True
:p a == b
> False
:p a == a
> True
:p log (exp a) ~~ a
> True
:p exp (log a) ~~ a
> True
:p log2 (exp2 a) ~~ a
> True
:p exp2 (log2 a) ~~ a
> True
:p sqrt (sq a) ~~ a
> True
:p log ((MkComplex 1.0 0.0) + a) ~~ log1p a
> True
:p sin (-a) ~~ (-(sin a))
> True
:p cos (-a) ~~ cos a
> True
:p tan (-a) ~~ (- (tan a))
> True
:p exp (pi .* (MkComplex 0.0 1.0)) ~~ (MkComplex (-1.0) 0.0)  -- Euler's identity
> True
:p ((sq (sin a)) + (sq (cos a))) ~~ (MkComplex 1.0 0.0)
> True
:p complex_abs b > 0.0
> True

:p sinh (MkComplex 1.2 3.2)
> (MkComplex -1.506887 -0.105696)
:p cosh (MkComplex 1.2 3.2)
> (MkComplex -1.807568 0.088114)
:p tanh (MkComplex 1.1 0.1)
> (MkComplex 0.803375 0.035809)
:p tan (MkComplex 1.2 3.2)
> (MkComplex 0.00225 1.002451)
